app/views/posts/index.html.erb

SELECT "posts".* FROM "posts"
---
  <li>
  (
   <%= link_to '+', vote_post_path(post, vote:true),method: 'post' %>

   <%= post.votes.size.to_s  %>
   <%= link_to '-', vote_post_path(post, vote:false),method: 'post' %>
   )