app/views/posts/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "categorizations" ON "categories"."id" = "categorizations"."category_id" WHERE "categorizations"."post_id" = ?  [["post_id", 2]]
---
<% @post.categories.each do |category| %>