app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 14 Aug 2013 17:52:57 UTC +00:00], ["name", "dsdsdsd"], ["updated_at", Wed, 14 Aug 2013 17:52:57 UTC +00:00]]
---
  def create
    @category = Category.new(params.require(:category).permit(:name))
    if @category.save