app/controllers/comments_controller.rb

   def vote
      @comment = Comment.find(params[:id])
      Vote.create(voteable: @comment, creator: current_user, vote: params[:vote])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "22"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 25 Aug 2013 05:12:31 UTC +00:00], ["updated_at", Sun, 25 Aug 2013 05:12:31 UTC +00:00], ["user_id", 9], ["vote", true], ["voteable_id", 23], ["voteable_type", "Comment"]]

  def create
    @post = Post.find(params[:post_id])
    @comment = Comment.new(params.require(:comment).permit(:body))
    @comment.post = @post
    #@comment.user = current_user  # just assigns the value, does NOT hit the database.
    @comment.creator = current_user

    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "fdfdfd"], ["created_at", Fri, 23 Aug 2013 08:13:47 UTC +00:00], ["post_id", 1], ["updated_at", Fri, 23 Aug 2013 08:13:47 UTC +00:00], ["user_id", 9]]