app/controllers/posts_controller.rb

SELECT "categories".* FROM "categories"
---
  def show
    #@post = Post.find(params[:id])   #  dont need because of the before_action and def set_post
    @comment = Comment.new
    @categories = Category.all

INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 14 Aug 2013 03:11:16 UTC +00:00], ["description", "Test Description"], ["title", "Test Title"], ["updated_at", Wed, 14 Aug 2013 03:11:16 UTC +00:00], ["url", "cnn.com"]]
---
  def create
    #binding.pry
    @post = Post.new(post_params)
    #@post.user = current_user
    @post.creator = current_user



    if @post.save

UPDATE "posts" SET "description" = ?, "url" = ?, "updated_at" = ? WHERE "posts"."id" = 4  [["description", "Ny new description"], ["url", "denverpost.com"], ["updated_at", Wed, 14 Aug 2013 06:43:58 UTC +00:00]]
---
  def update

   # @post = Post.find(params[:id])    #  dont need because of the before_action and def set_post

    if @post.update(post_params)

INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 24 Aug 2013 23:12:55 UTC +00:00], ["updated_at", Sat, 24 Aug 2013 23:12:55 UTC +00:00], ["user_id", 9], ["vote", true], ["voteable_id", 1], ["voteable_type", "Post"]]
---
  def vote
      Vote.create(voteable: @post, creator: current_user, vote: params[:vote])