app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'david' LIMIT 1
---
  def create
    #user = User.where(username: params[:username]).first

    user = User.find_by(username: params[:username])