app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?)
---
  def create
  	 # get a handle on the user. (username)

  	 #@user = User.new(users_params)

  	 @user = User.new(user_params)

  	 # call 'authenticate' on that user. pass in the password.

  	 #if @user.save
  	if @user.save